       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       DATA DIVISION.
          WORKING-STORAGE SECTION.
            77 X PIC 99.
            77 MinhaString PIC X(50).
      **** o comentario deve se iniciar na coluna 7 de cada linha
       PROCEDURE DIVISION.
           MOVE 11 TO  X
           MOVE "Exemplo de valor para MinhaString" TO MinhaString.
      *    DISPLAY X
           
           IF X EQUAL TO 10
               DISPLAY "X é igual a 10"
           ELSE
               DISPLAY "X não é igual a 10"
           END-IF
           
           GOBACK
       STOP RUN.
