       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       DATA DIVISION.
          WORKING-STORAGE SECTION.
            77 X PIC 99.
            77 MinhaString PIC X(50).

       PROCEDURE DIVISION.
           
           MOVE "Exemplo de valor para MinhaString" TO MinhaString.
           DISPLAY MinhaString
           GOBACK
       STOP RUN.
